---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransaction.Dispose
source: html/100e8ef4-ce14-17eb-19a5-541bbc788065.htm
---
# Autodesk.Revit.DB.IFC.IFCTransaction.Dispose Method

Releases all resources used by the IFCTransaction

## Syntax (C#)
```csharp
public void Dispose()
```